{
  "backend/main.mo": "Main Motoko actor implementing wound measurement storage with CRUD operations (create, read, delete) for wound data including metrics, images, and timestamps using blob storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting seven implemented wound analysis features (image upload, area measurement, perimeter analysis, circularity, color composition, texture, moisture) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, utilities, and configuration for the wound tracking application with medical-themed UI and comprehensive analysis features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark themes, medical color palette, and custom CSS variables for healthcare UI styling.",
  "frontend/index.html": "HTML entry point for the Wound Tracker application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React component with tabbed navigation (Analyze, History, Guide) managing wound analysis workflow, displaying results dashboard, historical data, and clinical interpretation guide.",
  "frontend/src/components/ColorCompositionDisplay.tsx": "React component displaying color composition analysis with percentage bars for red (healthy), pink (new skin), yellow (slough), and black (necrosis) tissue types with clinical interpretations and overall status badge.",
  "frontend/src/components/ImageUpload.tsx": "React component for uploading wound images with drag-and-drop support, preview display, and triggering wound analysis. Manages upload progress, file validation, and displays errors from both upload and analysis hooks.",
  "frontend/src/components/MetricDisplay.tsx": "Reusable card component that displays a single wound metric with label, value, interpretation text, and status badge (good/warning/concern/neutral) with corresponding icons.",
  "frontend/src/components/ResultsDashboard.tsx": "Dashboard component that displays comprehensive wound analysis results including image, metrics (area, circularity, texture, edge sharpness, moisture), color composition, and provides save-to-history functionality. Determines status levels for each metric based on threshold values.",
  "frontend/src/components/WoundHistory.tsx": "Component that displays a chronological list of saved wound measurements with images, metrics, health status badges, and delete functionality. Shows loading skeletons and empty state when no measurements exist.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "Hook for handling image file uploads with validation (type, size), progress tracking, and conversion to ExternalBlob format. Returns upload state, progress percentage, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Creates and configures AuthClient with custom options and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for wound measurement CRUD operations: fetching all measurements, fetching single measurement, creating new measurement, and deleting measurement. Automatically invalidates cache on mutations.",
  "frontend/src/hooks/useWoundAnalysis.ts": "React hook that orchestrates wound image analysis by loading an image onto a canvas, extracting ImageData, and running multiple analysis utilities (metrics, color, texture, edge, moisture) to produce a WoundAnalysisResult.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, medical color palette (red, pink, yellow, black tissue types), and utility classes for medical-themed gradients and colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that renders the root App component wrapped in QueryClientProvider and InternetIdentityProvider for React Query and authentication context.",
  "frontend/src/types/wound.ts": "TypeScript type definitions for WoundAnalysisResult (containing all wound metrics and image data) and ColorComposition (percentages of red, pink, yellow, black tissue).",
  "frontend/src/utils/colorAnalysis.ts": "Analyzes wound image pixels by converting RGB to HSV color space and classifying each pixel into red, pink, yellow, or black tissue categories based on hue, saturation, and brightness thresholds, returning percentage composition.",
  "frontend/src/utils/edgeAnalysis.ts": "Applies Sobel edge detection operators to calculate gradient magnitude across the image, identifying edge pixels and computing average gradient strength to determine wound edge sharpness (0-1 scale).",
  "frontend/src/utils/moistureAnalysis.ts": "Detects moisture/exudate by identifying specular highlights and very bright pixels with low saturation, calculating the proportion of glossy pixels to estimate exudate level (0-1 scale).",
  "frontend/src/utils/textureAnalysis.ts": "Measures wound texture smoothness by calculating local variance in 5x5 pixel windows across the image, with lower variance indicating smoother texture (normalized to 0-1 scale).",
  "frontend/src/utils/woundAnalysis.ts": "Converts image to binary using grayscale thresholding, then calculates wound area (pixel count), perimeter (edge pixel count), and circularity (4π×area/perimeter²) to quantify wound geometry.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, medical-themed colors, container settings, font families (Inter, Poppins), border radius variables, and accordion animations.",
  "project_state.json": "Project metadata documenting the medical wound assessment application architecture, existing features for image upload and seven analysis metrics (area, perimeter, shape, color, texture, edge, moisture), and required medical reference images."
}